seblee/TQ01M1/bsp/stm32f10x/drivers/usart_bsp.c
    /* register UART5 device */
    rt_hw_serial_register(&serial5, "uart5",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX,
                          uart);
#endif /* RT_USING_UART5 */
}

/**********************************佛山吉宝加热器***********************************************/

void Usart1_Rcc_Conf(void)
{
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    /* Enable UART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
    return;
}

void Usart1_Gpio_Conf(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    //USART1 Tx(PA.09)
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    //USART1 Rx(PA.10)
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    return;
}
void Usart1_Init_Conf(void)
{
    //USART1配置
    USART_InitTypeDef USART_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    USART_InitStructure.USART_BaudRate = 9600;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;

    ENTER_CRITICAL_SECTION(); //关全局中断

    USART_Init(USART1, &USART_InitStructure);
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    USART_Cmd(USART1, ENABLE);

    //=====================中断初始化======================================
    //设置NVIC优先级分组为Group2：0-3抢占式优先级，0-3的响应式优先级
    //	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    EXIT_CRITICAL_SECTION(); //开全局中断
    return;
}

void Usart1_Var_Init(uint8_t port)
{
    g_ComStat[port] = INIT_Apply;
    g_ComGap[port] = 0;
    Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
    memset(&g_ComBuff[port][0], 0x00, PROTOCOL_FRAME_MaxLen);
    return;
}
void Heat_Usart_Init(uint8_t port)
{
    Usart1_Var_Init(port);
    Usart1_Rcc_Conf();
    Usart1_Gpio_Conf();
    Usart1_Init_Conf();
    return;
}
//通信串口初始化
void xPort_Usart_Init(uint8_t ucMB_Number)
{
    switch (ucMB_Number)
    {
    case UART_HEAT:
        Heat_Usart_Init(ucMB_Number);
        break;
    case UART_PM25:

        break;
    default:
        break;
    }
    return;
}

void Heat_Usart_Close(void)
{
    USART_ClearITPendingBit(USART1, USART_IT_RXNE);
    USART_Cmd(USART1, DISABLE);
    return;
}
//关闭串口
void xPort_Usart_Close(uint8_t ucMB_Number)
{
    switch (ucMB_Number)
    {
    case UART_HEAT:
        Heat_Usart_Close();
        break;
    case UART_PM25:

        break;
    default:
        break;
    }
    return;
}

//串口发送数据
uint8_t UART_Send(uint8_t *u8Buf, uint8_t u8Len)
{
    uint8_t u8Se;
    uint8_t i;
    if (u8Len == 0)
    {
        return u8Se;
    }
    for (i = 0; i < u8Len; i++)
    {
        USART_SendData(USART1, u8Buf[i]); //发送数据
        while (USART_GetFlagStatus(USART1, USART_FLAG_TC) != SET)
            ; //等待发送结束
        u8Se = 1;
    }
    return u8Se;
}

//串口发送数据
uint8_t Heat_Send(uint8_t u8Type, uint8_t u8OC, uint8_t u8Temp, uint16_t u16WL)
{
    uint8_t u8SendBuf[HEATWRITE_NUM + 2] = {0};
    uint8_t u8Head = 0xAA;
    uint8_t u8Addr = 0x01;
    uint16_t u16Sum = 0x00;
    uint8_t i;

    if (u8Type == HEAT_READPARA)
    {
        u8SendBuf[0] = 0xA5;
        return UART_Send(&u8SendBuf[0], 1);
    }
    else
    {
        u8SendBuf[0] = u8Head;
        u8SendBuf[1] = u8Addr;
        u8SendBuf[2] = u8OC;
        u8SendBuf[3] = u8Temp;
        u8SendBuf[4] = u16WL >> 8;
        u8SendBuf[5] = (uint8_t)u16WL;
        for (i = 1; i < HEATWRITE_NUM - 1; i++)
        {
            u16Sum += u8SendBuf[i];
        }
        u8SendBuf[HEATWRITE_NUM - 1] = u16Sum >> 8;
        u8SendBuf[HEATWRITE_NUM] = (uint8_t)u16Sum;

        return UART_Send(&u8SendBuf[0], HEATWRITE_NUM + 1);
    }
}

uint8_t xPortSerialGetByte(char *pucByte, uint8_t ucMB_Number)
{
    switch (ucMB_Number)
    {
    case UART_HEAT:
        *pucByte = USART_ReceiveData(USART1);
        break;
    case UART_PM25:
        *pucByte = USART_ReceiveData(UART5);
        break;
    default:
        break;
    }
    return 1;
}

uint8_t AnalyseProtocol(uint8_t *u8Buff)
{
    extern local_reg_st l_sys;

    //出水状态
    l_sys.HeatWater_st = u8Buff[1];
    //出水流量
    l_sys.HeatWater_Flow = u8Buff[3];
    l_sys.HeatWater_Flow = (l_sys.HeatWater_Flow << 8) | u8Buff[4];
    rt_kprintf("u8Buff[1]=%d,3=%d,4=%d,l_sys.HeatWater_Flow=%d\n", u8Buff[1], u8Buff[3], u8Buff[4], l_sys.HeatWater_Flow);

    return 1;
}
/*************************************************
Function:void Comm_Service(void)// 函数名称
Description:// 函数功能、性能等的描述
			执行通讯任务
			状态机转换（正常情况）: RECV_Wait->RECV_Going->RECV_Over->
                                    SEND_Wait->SEND_Going->SEND_Over->RECV_Wait
Author:xdp（作者）
Calls:// 被本函数调用的函数清单
Called By:// 调用本函数的函数清单
			main();
Input:// 输入参数说明，包括每个参数的作
    // 用、取值说明及参数间关系。
Output:// 对输出参数的说明。
Return:// 函数返回值的说明
Others:// 其它说明
*************************************************/
void Comm_Service(void)
{
    extern sys_reg_st g_sys;
    uint8_t port; //通讯通道

    //    for (port=0; port<UART_NUM; port++)
    {
        port = UART_HEAT;
        g_ComGap[port]++;

        //		rt_kprintf("g_ComStat=%d,TEST=%d\n",g_ComStat[port],g_sys.status.ComSta.TEST);
        switch (g_ComStat[port])
        {
        case RECV_Wait: //接收等待（检查接收端是否打开）-------------------------

            break;
        case RECV_Going:                                 //接收进行（由g_ComGap检查）----------------------------
            if (g_ComGap[port] > PROTOCOL_FRAME_ByteGap) //接收超时？
            {
                g_ComStat[port] = INIT_Apply; //置"初始化"状态
            }
            break;
        case RECV_Over:                                //接收完成（转换状态明确）-------------------------------
                                                       //	            xPort_Usart_Close(port);                           //关闭通讯通道
            if (!AnalyseProtocol(&g_ComBuff[port][0])) //
            {
            }
            memset(&g_ComBuff[port][0], 0x00, PROTOCOL_FRAME_MaxLen);
            g_ComStat[port] = SEND_Wait; //置"发送等待"状态
            break;
        case SEND_Wait: //发送等待（由g_ComGap检查）----------------------------
                        //	            if (g_ComGap[port]> PROTOCOL_FRAME_SendGap)               //发送延时到？
        {
            g_ComGap[port] = 0;           //通讯字节间隔定时开始
            g_ComStat[port] = SEND_Going; //置"正在发送"状态
        }
        break;
        case SEND_Going: //正在发送（检查发送端是否打开）------------------------
            if (g_ComGap[port] < 100)
            {
                break;
            }
        case SEND_Over:
        case INIT_Apply:                 //接收错误----------------------------------------------
        default:                         //其他状态------------------------------------------------------
                                         //	          xPort_Usart_Init(port);          //通道初始化（复位）
            g_ComStat[port] = RECV_Wait; //置"接收等待"状态
                                         //							memset(&g_ComBuff[port][0],0x00,PROTOCOL_FRAME_MaxLen);
            break;
        }
    }
    return;
}

//加热器串口接收数据
uint8_t HeatPortSerialReceiveFSM(uint8_t port)
{
    extern sys_reg_st g_sys;
    uint8_t RXDByte;
    uint16_t u16CheckSum;

    g_sys.status.ComSta.TEST |= 0x01;
    /* Always read the character. */
    (void)xPortSerialGetByte((char *)&RXDByte, port);
    g_ComGap[port] = 0;
    switch (Protocol[port].StatckStatus)
    {
    case PROTOCOL_STACK_IDLE:
        // 空闲状态,等待接收帧首字符(01)
        //		    if ((g_ComStat[port]==RECV_Wait)                        //当前正"接收等待"
        //		    &&(0x01== RXDByte))
        if (0x01 == RXDByte)
        {
            g_ComStat[port] = RECV_Going; //置"接收进行"状态
            g_ComBuff[port][0] = RXDByte;
            u16FrameCheckSum = RXDByte;
            Protocol[port].DataCount = 1;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x02;
            g_sys.status.ComSta.TEST4 = u16FrameCheckSum;
        }
        break;
    case PROTOCOL_STACK_CK:
        if ((HEAT_OPEN == RXDByte) //当前正"接收等待"
            || (HEAT_CLOSE == RXDByte))
        {
            // 累加校验和
            u16FrameCheckSum += RXDByte;
            g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
            u8FrameDataLength = 14;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x04;
        }
        else
        {
            // 帧错误,协议解析复位
            Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
            g_ComStat[port] = INIT_Apply; //置"发送等待"状态
        }
        g_sys.status.ComSta.TEST5 = u16FrameCheckSum;
        break;
    case PROTOCOL_STACK_RCV:
        // 累加校验和
        u16FrameCheckSum += RXDByte;
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            // 接收校验和
            g_sys.status.ComSta.TEST6 = u16FrameCheckSum;
            u8FrameDataLength = 2;
            Protocol[port].StatckStatus++;
        }
        g_sys.status.ComSta.TEST |= 0x08;
        break;
    case PROTOCOL_STACK_CS:
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            g_sys.status.ComSta.TEST |= 0x10;
            // 接收校验和
            u16CheckSum = g_ComBuff[port][16];
            u16CheckSum = (u16CheckSum << 8) | g_ComBuff[port][17];
            g_sys.status.ComSta.TEST2 = u16FrameCheckSum;
            g_sys.status.ComSta.TEST3 = u16CheckSum;
            if (u16CheckSum == u16FrameCheckSum)
            {
                g_sys.status.ComSta.TEST |= 0x20;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = RECV_Over; //置"接收完成"状态
            }
            else
            {
                // 校验和不正确,协议解析复位
                g_sys.status.ComSta.TEST |= 0x40;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = INIT_Apply; //置"初始化"状态
            }
        }
        break;
    case PROTOCOL_STACK_END:

        break;
    default:
        Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
        g_ComStat[port] = INIT_Apply; //置"初始化"状态
        break;
    }
    return 1;
}

void USART1_IRQHandler(void)
{

    rt_interrupt_enter();
    //溢出错误
    if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) == SET)
    {
        ;
    }
    //接收中断
    if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
    {
        HeatPortSerialReceiveFSM(UART_HEAT);
        USART_ClearITPendingBit(USART1, USART_IT_RXNE);
    }
    //发送中断
    if (USART_GetITStatus(USART1, USART_IT_TXE) == SET)
    {
        ;
    }
    rt_interrupt_leave();
}
